#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/matheuscscp/splitwiser/runs/run-ixXw7GwTFJpoLyLf

Waiting for the plan to start...

Terraform v1.2.6
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_member.start-bot-secret-accessor will be created
  + resource "google_project_iam_member" "start-bot-secret-accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "splitwiser-356519"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_service_account.start-bot will be created
  + resource "google_service_account" "start-bot" {
      + account_id   = "start-bot-cloud-function"
      + disabled     = false
      + display_name = "StartBot Cloud Function (Provisioned by Terraform)"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.



```
*Pushed by: @matheuscscp, Action: `pull_request`*